Ac6Embedded/svd-microchip/PIC32CM_GV/PIC32CM1602GV00032.svd
            <register>
               <name>GENCTRL</name>
               <description>Generic Clock Generator Control</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>ID</name>
                     <description>Generic Clock Generator Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>IDSelect</name>
                        <enumeratedValue>
                           <name>GCLK0</name>
                           <description>Generic clock generator 0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK1</name>
                           <description>Generic clock generator 1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK2</name>
                           <description>Generic clock generator 2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK3</name>
                           <description>Generic clock generator 3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK4</name>
                           <description>Generic clock generator 4</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK5</name>
                           <description>Generic clock generator 5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK6</name>
                           <description>Generic clock generator 6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK7</name>
                           <description>Generic clock generator 7</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRC</name>
                     <description>Source Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SRCSelect</name>
                        <enumeratedValue>
                           <name>XOSC</name>
                           <description>XOSC oscillator output</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLKIN</name>
                           <description>Generator input pad</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLKGEN1</name>
                           <description>Generic clock generator 1 output</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSCULP32K</name>
                           <description>OSCULP32K oscillator output</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSC32K</name>
                           <description>OSC32K oscillator output</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>XOSC32K</name>
                           <description>XOSC32K oscillator output</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSC8M</name>
                           <description>OSC8M oscillator output</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DFLL48M</name>
                           <description>DFLL48M output</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GENEN</name>
                     <description>Generic Clock Generator Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDC</name>
                     <description>Improve Duty Cycle</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OOV</name>
                     <description>Output Off Value</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OE</name>
                     <description>Output Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIVSEL</name>
                     <description>Divide Selection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DIVSELSelect</name>
                        <enumeratedValue>
                           <name>DIV1</name>
                           <description>Divide input directly by divider factor</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>Divide input by 2^(divider factor+ 1)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GENDIV</name>
               <description>Generic Clock Generator Division</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>ID</name>
                     <description>Generic Clock Generator Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>IDSelect</name>
                        <enumeratedValue>
                           <name>GCLK0</name>
                           <description>Generic clock generator 0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK1</name>
                           <description>Generic clock generator 1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK2</name>
                           <description>Generic clock generator 2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK3</name>
                           <description>Generic clock generator 3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK4</name>
                           <description>Generic clock generator 4</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK5</name>
                           <description>Generic clock generator 5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK6</name>
                           <description>Generic clock generator 6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK7</name>
                           <description>Generic clock generator 7</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIV</name>
                     <description>Division Factor</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
